
__CLASS__	        Если используется внутри класса, возвращается имя класса.
__DIR__ 	        Каталог, в котором находится файл.
__FILE__    	    Имя файла, включая полный путь.
__FUNCTION__	    Если внутри функции, возвращается имя функции.
__LINE__	        Текущий номер строки.
__METHOD__	        Если используется внутри функции, принадлежащей классу, возвращается имя класса и имя функции.
__NAMESPACE__	    Если используется внутри пространства имен, возвращается имя пространства имен.
__TRAIT__	        Если используется внутри признака, возвращается имя признака.
ClassName::class	Возвращает имя указанного класса и имя пространства имён, если таковое имеется.

Магические константы не чувствительны к регистру, то есть __LINE__ возвращает то же самое, что и __line__.



