array()	                    Создает массив
array_change_key__case()	Изменяет все ключи в массиве на строчные или заглавные
array_chunk()	            Разбивает массив на фрагменты массивов
array_column()	            Возвращает значения из одного столбца во входном массиве
array_combine()	            Создаёт массив, используя элементы из одного массива «ключей» и одного массива «значений»
array_count_values()	    Подсчитывает все значения массива
array_diff()	            Сравнивает массивы и возвращает различия (только для сравнения значений)
array_diff_assoc()	        Сравнивает массивы и возвращает различия (сравнивает ключи и значения)
array_diff_key()	        Сравнивает массивы и возвращает различия (только для сравнения ключей)
array_diff_uassoc()	        Сравнивает массивы и возвращает различия (сравнивает ключи и значения с помощью заданной пользователем функции сравнения ключей)
array_diff_ukey()	        Сравнивает массивы и возвращает различия (сравниваются только ключи с использованием заданной пользователем функции сравнения ключей)
array_fill()	            Заполняет массив значениями
array_fill_keys()	        Заполняет массив значениями, указывающими ключи
array_filter()	            Фильтрует значения массива с помощью функции обратного вызова
array_flip()	            Переворачивает / Обменивает все ключи на связанные с ними значения в массиве
array_intersect()	        Сравнивает массивы и возвращает совпадения (только для сравнения значений)
array_intersect_assoc()	    Сравнивает массивы и возвращает совпадения (сравнивает ключи и значения)
array_intersect_key()	    Сравнивает массивы и возвращает совпадения (только для сравнения ключей)
array_intersect_uassoc()	Сравнивает массивы и возвращает совпадения (сравнивает ключи и значения с помощью заданной пользователем функции сравнения ключей)
array_intersect_ukey()	    Сравнивает массивы и возвращает совпадения (сравнивает только ключи, используя заданную пользователем функцию сравнения ключей)
array_key_exists()	        Проверяет, существует ли указанный ключ в массиве
array_keys()	            Возвращает все ключи массива
array_map()	                Отправляет каждое значение массива в пользовательскую функцию, которая возвращает новые значения
array_merge()	            Объединяет один или несколько массивов в один массив
array_merge_recursive()	    Рекурсивно объединяет один или несколько массивов в один массив
array_multisort()	        Сортирует множественные или многомерные массивы
array_pad()	                Добавляет в массив указанное количество элементов с указанным значением
array_pop()	                Удаляет последний элемент массива
array_product()	            Вычисляет произведение значений в массиве
array_push()	            Вставляет один или несколько элементов в конец массива
array_rand()	            Возвращает один или несколько случайных ключей из массива
array_reduce()	            Возвращает массив в виде строки, используя определяемую пользователем функцию
array_replace()	            Заменяет значения первого массива значениями из следующих массивов
array_replace_recursive()	Рекурсивно заменяет значения первого массива значениями из следующих массивов
array_reverse()	            Возвращает массив в обратном порядке
array_search()	            Выполняет поиск в массиве заданного значения и возвращает ключ
array_shift()	            Удаляет первый элемент из массива и возвращает значение удалённого элемента
array_slice()	            Возвращает выбранные части массива
array_splice()	            Удаляет и заменяет указанные элементы массива
array_sum()	                Возвращает сумму значений в массиве
array_udiff()	            Сравнивает массивы и возвращает различия (сравниваются только значения с использованием заданной пользователем функции сравнения ключей)
array_udiff_assoc()	        Сравнивает массивы и возвращает различия (сравнивает ключи и значения, используя встроенную функцию для сравнения ключей и пользовательскую функцию для сравнения значений)
array_udiff_uassoc()	    Сравнивает массивы и возвращает различия (сравнивает ключи и значения с помощью двух пользовательских функций сравнения ключей)
array_uintersect()	        Сравнивает массивы и возвращает совпадения (сравниваются только значения с помощью пользовательской функции сравнения ключей)
array_uintersect_assoc()	Сравнивает массивы и возвращает совпадения (сравнивает ключи и значения, используя встроенную функцию для сравнения ключей и пользовательскую функцию для сравнения значений)
array_uintersect_uassoc()	Сравнивает массивы и возвращает совпадения (сравнивает ключи и значения с помощью двух пользовательских функций сравнения ключей)
array_unique()	            Удаляет повторяющиеся значения из массива
array_unshift()	            Добавляет один или несколько элементов в начало массива
array_values()	            Возвращает все значения массива
array_walk()	            Применяет пользовательскую функцию к каждому элементу массива
array_walk_recursive()	    Рекурсивно применяет пользовательскую функцию к каждому элементу массива
arsort()	                Сортирует ассоциативный массив в порядке убывания в соответствии со значением
asort()	                    Сортирует ассоциативный массив в порядке возрастания в соответствии со значением
compact()	                Создать массив, содержащий переменные и их значения
count()	                    Возвращает количество элементов в массиве
current()	                Возвращает текущий элемент в массиве
each()	                    Устарело в PHP 7.2. Возвращает текущую пару ключ-значение из массива
end()	                    Устанавливает внутренний указатель массива на его последний элемент
extract()	                Импортирует переменные в текущую таблицу символов из массива
in_array()	                Проверяет, существует ли указанное значение в массиве
key()	                    Извлекает ключ из массива
krsort()	                Сортирует ассоциативный массив в порядке убывания в соответствии с ключом
ksort()	                    Сортирует ассоциативный массив в порядке возрастания в соответствии с ключом
list()	                    Присваивает переменные так, как если бы они были массивом
natcasesort()	            Сортирует массив с помощью алгоритма «естественного порядка», нечувствительного к регистру
natsort()	                Сортирует массив с использованием алгоритма "естественного порядка"
nex()	                    Переместите внутренний указатель на массив массива
pos()	                    Псевдоним current()
prev()	                    Перематывает внутренний указатель массива
range()	                    Создает массив, содержащий диапазон элементов
reset()	                    Устанавливает внутренний указатель массива на его первый элемент
rsort()	                    Сортирует индексированный массив в порядке убывания
shuffle()	                Перетасовывает массив
sizeof()	                Псевдоним count()
sort()	                    Сортирует индексированный массив в порядке возрастания
uasort()	                Сортирует массив по значениям с помощью заданной пользователем функции сравнения и сохраняет связь с индексами
uksort()	                Сортирует массив по ключам с помощью определяемой пользователем функции сравнения
usort()	                    Сортирует массив по значениям с помощью определяемой пользователем функции сравнения